export default {
  0: '',

  10000: '未知的错误',

  20001: '用户名或密码错误',
  20002: '尚未登录',
  20003: '已存在的用户组',
  20004: '不可变更的用户组',
  20005: '当前用户组已有关联用户',
  20006: '已存在的用户',
  20007: '旧密码错误',
  20008: '无权访问',
  20009: '话题标签名称必须在2至4位之间',
  20010: '话题标签标识必须在2至8位之间',
  20011: '话题标签名称已存在',
  20012: '话题标签标识已存在',
  20013: '话题标签不存在',
  20014: '话题标题不能为空',
  20015: '话题内容不能为空',
  20016: '话题标签不能为空',
  20017: '话题不存在',
  20018: '不能删除别人的话题',
  20019: '不能修改别人的话题',

  30001: '当前邮箱已注册',
  30002: '当前昵称已注册',
  30003: '邮箱或者密码错误',

  40001: '邮箱格式不正确',
  40002: '密码必须为数字、字母和特殊字符其中两种组成并且在6至18位之间',
  40003: '昵称必须在2至8位之间',
};
